<template>
    <div>
        <textarea class="form-control" rows="18" v-model="content"></textarea>
        <div class="row mt-3 justify-content-end">
            <div class="form-check" style="line-height: 1.5">
                <input class="form-check-input" v-model="agreeFlag" type="checkbox" value="" id="defaultCheck1">
                <label class="form-check-label" for="defaultCheck1">我已阅读《用户协议》，并同意其内容</label>
            </div>
            <button type="button"  @click="goBackHome" style="margin: 0 .5rem;" class="btn btn-sm">取消</button>
            <button type="button"  @click="goNext" style="margin: 0 .5rem; margin-right: 1rem;" class="btn btn-sm btn-success">下一步</button>
        </div>
    </div>
</template>

<script>
export default {
    name: 'beforeSign', 
    methods: {
        goBackHome(){
            this.$router.push("/login");
        },
        goNext(){
            console.log(this.agreeFlag);    // 同意协议为true，反对为false
            if(this.$store.state.auth.agreeSign && this.agreeFlag){
                this.$router.push("/sign");
            }else{
                alert("请同意本协议后再进行注册！");
            }
        }
    },  
    watch: {
        agreeFlag(){
            if(this.agreeFlag){
                this.$store.commit('agree');
            }else {
                this.$store.commit('disagree');
            }
        }
    },
    data(){
        return {
            agreeFlag: "",
            content: `欢迎来到潞安煤基油电子采购平台，如您确定成为本网用户，必须遵守本协议，如表示同意，您即与潞安煤基油电子采购平台签定入网协议，并受本协议约束，请仔细审阅。
一、用户的权利与责任。
1、权利
（1）您可以在本网站上传资质文件和下载标书、查看所投标项目的相关信息，并进行投标、竞价。
（2）如您发现在本网站上有操作或质疑的问题，有查询和澄清的权利。
（3）有权对山西潞安煤基合成油有限公司相关业务及人员进行投诉，欢迎您进行监督。
2、责任
（1）必须保证所提供资质的真实性和准确性。如提供虚假信息，将被永久取消给山西潞安煤基合成油有限公司供货或竞买资格，并承担由此造成的后果。
（2）中标单位必须在规定期限内签订并履行合同。
（3）不得将登录帐号转给其他单位或个人使用，否则，您将承担因此给造成的后果。
（4）不利用登录帐号对本网站非法登录或进行数据破坏活动。
（5）如果您的用户名和密码因保管不善丢失或泄露，应立即书面通知山西潞安煤基合成油有限公司招标方，申请停用；否则，由此引起的后果，由您承担。停止使用期间，将无法进行业务；如需要继续进行业务，须重新设置用户名和密码，并将您的承诺书书面提交本中心，中心可重新给予开通业务。
二、与山西潞安煤基合成油有限公司开展业务的办事程序：
（1）新供方注册，在网上提交您的相关资质，交易中心组织评审通过，即获得山西潞安煤基合成油有限公司某采购单位合格供方资格。
（2）合格供方在潞安煤基油电子采购平台上完成标书下载或获取竞价信息。
（3）供方网上投标或竞价。
（4）山西潞安煤基合成油有限公司组织采购单位和评标专家在网上开评标。
（5）山西潞安煤基合成油有限公司台在网上发布中标公告。
（6）双方签定并执行合同。
三、本网站的权利与责任
1、权利
（1）当用户违反相关法律法规或本协议规定，以及本公司规章制度时，本网站有权取消其信息的发布或入网权限，直至追究法律责任。
（2）当网站出现安全方面的紧急状况时，本网站有权短时间暂停服务。
2、责任
（1）本网站有责任保证信息的准确性。
（2）本网站有责任保证信息的安全性。
四、适用法律、法规
1、《中华人民共和国公安部计算机安全法》
2、《中华人民共和国招投标法》
3、《中华人民共和国合同法》
4、《招标公告发布暂行办法》
5、《评标委员会和评标方法暂行规定》
6、《甘肃省招投投标条例》
五、免责声明
以下情况本网站声明免责：
1、本网已经采取合理的防电脑病毒手段，但仍遭受电脑病毒破坏的致使用户资料受损，以及产生的后果不承担任何责任。
2、本网已经采取合理的防电脑黑客入侵手段，但仍遭受电脑黑客入侵致使用户资料受损或被窃取，以及产生的后果不承担任何责任。
3、因计算机设施或操作系统软件本身固有的技术缺陷而引起的用户资料数据受损或被窃取，以及产生的后果不承担任何责任。
4、无法预见、无法避免且无法克服的其它不可抗情况，本网站不承担任何责任。
5、本网站对任何因用户不正当或非法使用服务，及用户发布言论、信息而产生的直接、间接、偶然、特殊及后续的损害不承担任何责任。
6、本网站对因第4条规定的不可抗力原因造成的服务中断或不能满足用户的要求及产生后果不承担任何责任。
7、由于通信线路、网络、用户所在位置以及其它任何技术原因导致用户不能接受本网服务时，本网站不承担任何责任。
8、对于因注册用户提交资料不准确或不及时更新其资料而给他人或自己造成的任何损失、影响及风险，本网站不承担任何责任。`
        }
    }
}
</script>
